app/controllers/emails_controller.rb

  def create
    @email = Email.create(object: Faker::Lorem.word.capitalize, body: Faker::Lorem.paragraph, read: false)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Quos"], ["body", "Porro maxime deserunt. Sint adipisci animi. Voluptas provident vero."], ["created_at", "2020-03-05 21:26:41.549541"], ["updated_at", "2020-03-05 21:26:41.549541"]]

  def show
    @email = Email.find(params[:id])
    @email.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-03-05 21:26:35.219842"], ["id", 1]]